import background from "../hand.jpg"
import letterTattooFirst from "./nadpis1.jpg"
import letterTattooSecond from "./nadpis2.jpg"
import letterTattooThird from "./nadpis3.jpg"
import backTattooFirst from "./back1.jpg"
import backTattooSecond from "./back2.jpg"
import backTattooThird from "./back3.jpg"
import handTattooFirst from "./hand1.jpg"
import handTattooSecond from "./hand2.jpg"
import handTattooThird from "./hand3.jpg"
import "./gallery.css"

export const Gallery = () => {


    return <div id="page-content-wrapper">

        <div className="first-section">

            <img className="background-img" src={background}></img>

            <div className="title-heading">
                <h1>Галерия</h1>
            </div>


        </div>



        <section id="barbers" className="section lb">


            <div className="heading center">
                <small>Тук ще откриете част от нашите татуировки</small>
                <hr className="grd1" />

            </div>

            <div className="gallery-section">
                <h3 className="heading center">Надписи</h3>
                <p className="par">Тази категория е много популярна в изкуството на татуировките.
                    Надписите носят директен смисъл и подтекст.
                    В болшинството си, означават точно това, което е написано в избрания фрагмент.
                    Изпълняват се в различни калиграфски шрифтове на избран реален или измислен език.
                    Те могат да изглеждат елегантно и минималистично.
                    Понякога татуировката от само един йероглиф може да изразява много повече смисъл от дължината си.
                    От йероглифи могат да се създадат цели фрази.
                    Често надписите, които момичетата си татуират, са съпроводени от сърчица, звездички, цветенца и други подобни орнаменти.
                </p>
                <p className="par">
                    Най-разпространените надписи са имена, значими и важни за притежателя дати, афоризми, цитати на велики хора, лозунги, красиви откъси от песни и литературни произведения.
                    Освен на роден език, предпочитани са надписите на латински, на иврит, на арабски, на китайски, на японски.
                    Татуировката във вид на надпис може да стане отличен мотиватор за вас и за околните.
                    Татусите с думи или цитати са най-добрия начин да се разкрие същността на човека, да се напомни през какви изпитания е преминал или кои са щастливите моменти в живота му.
                    Чрез текста се проявява индивидуалността на личността.
                    Едно от  най-популярните места за поставяне на надпис е ръката.
                </p>
                <div className="gallery-tattoo-images">

                    <img src={letterTattooFirst} />
                    <img src={letterTattooSecond} />
                    <img src={letterTattooThird} />
                </div>
            </div>

            <div className="gallery-section">
                <h3 className="heading center">На ръка</h3>
                <p className="par">Ръцете също се ползват с огромна популярност, когато става дума за татуиране. Причина за това е откритостта на тази част от тялото, благодарение на което, притежателят на татуировката я показва максимално често. Ръцете са и най-подвижната част на човека, която може да се раздели на няколко елемента и за всеки един от тях да се избере най-подходящата по размер и цвят рисунка. Най-често за ръцете се избират големи по размер татуси. Те могат да се разделят на няколко категории:
                    <ul className="tattoo-styles">
                        <li>Дълъг ръкав: Това е татуировка, която започва от рамото и завършва на китката. Може да се състои от цялостно изображение или от много, обединени в едно рисунки.
                        </li>
                        <li>
                            Половин ръкав: Тази татуировка може да се разположи както на горната, така и на долната част на ръката. Може да започне от рамото и да свърши на лакътя или да е разположена от лакътя до китката.
                        </li>
                        <li>
                            Четвърт ръкав: Започва от рамото и завършва малко по-високо от лакътя.
                        </li>
                        <li>
                            Пръсти: Татуировката върху пръстите е нова тенденция. Тези изображения са малки, трудно се забелязват, но не са лишени от привлекателност, стил и оригиналност. Тази мъничка рисунка, която често изглежда като пръстен, може да означава много и да каже много за своя притежател. Най-популярните татуси за пръсти са надписите, символите, флоралните мотиви, фауната и дантелите.
                        </li>
                    </ul>





                </p>
                <div className="gallery-tattoo-images">
                    <img src={handTattooFirst} />
                    <img src={handTattooSecond} />
                    <img src={handTattooThird} />
                </div>
            </div>

            <div className="gallery-section">
                <h3 className="heading center">На гръб</h3>
                <p className="par">
                    Татуировките по гърба са наследници на бойните изображения по гърбовете на древните инки. Днес татусът на гърба е изключително популярен както с мащабността си, така и във варианта си на малка рисунка или ограничен само по гръбначния стълб. Обикновено мащабните татуировки изобразяват цял сюжет или сцена. Има няколко причини за татуиране точно на това място от тялото. Преди всичко, гърбът има равна и обширна повърхност и върху него може да се пресъздава рисунка с множество малки детайли. Татуираният гръб изглежда много красиво, а линията на гръбначния стълб дава симетрия на изображението. Мускулите на гърба се деформират по-малко с времето и така татуировката радва притежателя си и околните дълги години. От друга страна, ако е необходимо, татуировката на гърба лесно може да бъде скрита под дрехите. Красивата татуировка подчертава мускулите на гърба и придава чар и загадъчност.
                </p>
                <p className="par">Често този вид татуиране се изпълнява в много цветове и оттенъци. Понякога гърбът може да бъде изрисуван с различни, несвързани помежду си татуировки. Ако сте решили да украсите повърхността на гърба си изцяло, подгответе се за 4-5 или повече сеанса, в зависимостта от сложността на работата и габаритите на гърба. Най-популярни са рисунките на криле – ангелски, демонски или смесени, огромните цветни дракони, които започват от кръста и стигат до рамото, многобройните надписи с големи букви и т.н.</p>
                <div className="gallery-tattoo-images">
                    <img src={backTattooFirst} />
                    <img src={backTattooSecond} />
                    <img src={backTattooThird} />
                </div>
            </div>
        </section>



    </div>

}